BitBoxSwiss/bitbox02-firmware/src/da14531/da14531_handler.c
// SPDX-License-Identifier: Apache-2.0

#include "da14531/da14531_handler.h"
#include "da14531.h"
#include "hardfault.h"
#include "memory/memory.h"
#include "memory/memory_shared.h"
#if FACTORYSETUP == 0
    #include "screen.h"
    #include "ui/screen_stack.h"
    #include "ui/ui_util.h"
    #include "usb/class/usb_size.h"
    #include "usb/usb_frame.h"
    #include "usb/usb_packet.h"
    #include "usb/usb_processing.h"
#endif
#include <rust/rust.h>
#if FACTORYSETUP == 0
    #include <ui/components/confirm.h>
    #include <ui/components/ui_images.h>
    #include <ui/fonts/monogram_5X9.h>
#endif
#include <utils_assert.h>

const uint8_t* da14531_handler_current_product = NULL;
uint16_t da14531_handler_current_product_len = 0;

struct da14531_ctrl_frame {
    enum da14531_protocol_packet_type type;
    uint16_t payload_length; // includes length of cmd
    uint8_t cmd;
    uint8_t cmd_data[];
} __attribute((packed));

#if !defined(BOOTLOADER)
    #define BLE_PAIRING_KEY_SIZE 4

    #if FACTORYSETUP == 0
static component_t* _ble_pairing_component = NULL;

struct pairing_callback {
    uint8_t key[BLE_PAIRING_KEY_SIZE];
    struct RustByteQueue* queue;
};

static struct pairing_callback _ble_pairing_callback_data;

static void _ble_pairing_cleanup(component_t* component)
{
    if (_ble_pairing_component == component) {
        _ble_pairing_component = NULL;
    }
    ui_util_component_cleanup(component);
}

static const component_functions_t _ble_pairing_component_functions = {
    .cleanup = _ble_pairing_cleanup,
    .render = ui_util_component_render_subcomponents,
    .on_event = NULL,
};
    #endif

static void _ble_pairing_respond(const uint8_t* key, struct RustByteQueue* queue, bool ok)
{
    uint8_t payload[18] = {0};
    payload[0] = CTRL_CMD_TK_CONFIRM;
    memcpy(&payload[1], key, BLE_PAIRING_KEY_SIZE);
    payload[17] = ok ? 1 : 0; /* 1 yes, 0 no */

    uint8_t tmp[12 + sizeof(payload) * 2];
    uint16_t len = da14531_protocol_format(
        &tmp[0], sizeof(tmp), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, payload, sizeof(payload));
    ASSERT(len <= sizeof(tmp));
    for (int i = 0; i < len; i++) {
        rust_bytequeue_put(queue, tmp[i]);
    }
}

    #if FACTORYSETUP == 0
static void _ble_pairing_callback(bool ok, void* param)
{
    struct pairing_callback* data = (struct pairing_callback*)param;

    _ble_pairing_respond(data->key, data->queue, ok);

    ui_screen_stack_pop();
    _ble_pairing_component = NULL;
}
    #endif
#else
    #include <bootloader/bootloader.h>
extern bool bootloader_pairing_request;
extern uint8_t bootloader_pairing_code_bytes[4];
#endif

#if FACTORYSETUP == 1
bool _bond_db_set = false;

bool da14531_handler_bond_db_set(void)
{
    return _bond_db_set;
}
#endif

static void _ctrl_handler(const struct da14531_ctrl_frame* frame, struct RustByteQueue* queue)
{
    switch (frame->cmd) {
    case CTRL_CMD_DEVICE_NAME: {
        // util_log("da14531: get device name");
        //  1 byte cmd
        //  rest device name
        uint8_t response[1 + MEMORY_DEVICE_MAX_LEN_WITH_NULL] = {0}; // +1 for cmd
        response[0] = CTRL_CMD_DEVICE_NAME;
#if defined(BOOTLOADER)
        memory_random_name((char*)&response[1]);
#else
        memory_get_device_name((char*)&response[1]);
#endif
        uint8_t tmp[12 + sizeof(response) * 2];
        uint16_t len = da14531_protocol_format(
            &tmp[0],
            sizeof(tmp),
            DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA,
            &response[0],
            1 + strlen((char*)&response[1]));
        ASSERT(len <= sizeof(tmp));
        for (int i = 0; i < len; i++) {
            rust_bytequeue_put(queue, tmp[i]);
        }
    } break;
    case CTRL_CMD_BOND_DB_GET: {
        // util_log("da14531: get bond db");
        uint8_t response[1 + MEMORY_BLE_BOND_DB_LEN]; // +1 for cmd
        response[0] = CTRL_CMD_BOND_DB_GET;
        int16_t len = memory_get_ble_bond_db(&response[1]);
        // util_log("da14531: bond db len %d", len);
        uint16_t tmp_len;
        uint8_t tmp[12 + sizeof(response) * 2];
        if (len >= 0) {
            tmp_len = da14531_protocol_format(
                &tmp[0],
                sizeof(tmp),
                DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA,
                &response[0],
                1 + (uint16_t)len);
        } else {
            tmp_len = da14531_protocol_format(
                &tmp[0], sizeof(tmp), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, &response[0], 1);
        }
        ASSERT(tmp_len <= sizeof(tmp));
        for (int i = 0; i < tmp_len; i++) {
            rust_bytequeue_put(queue, tmp[i]);
        }
    } break;
    case CTRL_CMD_BOND_DB_SET:
        // util_log("da14531: set bond db");
        if (frame->payload_length < 2) {
            util_log("da14531: set bond db, invalid length");
            ASSERT(false);
            break;
        }
        if (!memory_set_ble_bond_db(&frame->cmd_data[0], frame->payload_length - 1)) {
            util_log("da14531: set bond db failed");
            ASSERT(false);
            break;
        }
#if FACTORYSETUP == 1
        _bond_db_set = true;
#endif
        break;
    case CTRL_CMD_PAIRING_CODE: {
        if (frame->payload_length < 5) {
            util_log("da14531: pairing code, invalid length");
            ASSERT(false);
            break;
        }
#if FACTORYSETUP == 1
        _ble_pairing_respond(&frame->cmd_data[0], queue, false);
#elif !defined(BOOTLOADER)
        // A running HWW task can own a Rust-backed screen. Do not overlay it: if its watchdog
        // cancels the task, the Rust screen owner assumes that its component is still on top.
        if (usb_processing_locked(usb_processing_hww())) {
            _ble_pairing_respond(&frame->cmd_data[0], queue, false);
            break;
        }
        memcpy(
            &(_ble_pairing_callback_data.key)[0],
            &frame->cmd_data[0],
            sizeof(_ble_pairing_callback_data.key));
        _ble_pairing_callback_data.queue = queue;
        uint32_t pairing_code_int;
        memcpy(&pairing_code_int, &frame->cmd_data[0], sizeof(pairing_code_int));
        pairing_code_int %= 1000000;
        char pairing_code[7] = {0};
        for (size_t i = sizeof(pairing_code) - 1; i > 0; i--) {
            pairing_code[i - 1] = '0' + pairing_code_int % 10;
            pairing_code_int /= 10;
        }
        // util_log("da14531: show/confirm pairing code: %s", pairing_code);
        const confirm_params_t confirm_params = {
            .title = "Pairing code",
            .body = pairing_code,
            .font = &font_monogram_5X9,
        };
        _ble_pairing_component = confirm_create(
            &confirm_params, _ble_pairing_callback, (void*)&_ble_pairing_callback_data);
        _ble_pairing_component->f = &_ble_pairing_component_functions;
        ui_screen_stack_push(_ble_pairing_component);
#else
        memcpy(
            &bootloader_pairing_code_bytes[0],
            &frame->cmd_data[0],
            sizeof(bootloader_pairing_code_bytes));
        bootloader_render_ble_confirm_screen(false);
#endif
    } break;
    case CTRL_CMD_BLE_STATUS:
        if (frame->payload_length < 2) {
            util_log("da14531: ble status, invalid length");
            ASSERT(false);
            break;
        }
        if (frame->cmd_data[0] <= DA14531_CONNECTED_CONNECTED_SECURED) {
            da14531_connected_state = frame->cmd_data[0];
        }
        // util_log("da14531: BLE status update");
#if defined(BOOTLOADER)
        bootloader_pairing_request = false;
        bootloader_render_default_screen();
#endif
        switch (frame->cmd_data[0]) {
        case DA14531_CONNECTED_ADVERTISING:
            util_log("da14531: adveritising");
#if !defined(BOOTLOADER) && FACTORYSETUP == 0
            if (_ble_pairing_component != NULL && ui_screen_stack_top() == _ble_pairing_component) {
                ui_screen_stack_pop();
                _ble_pairing_component = NULL;
            }
#endif
            break;
#if !defined(NDEBUG)
        case DA14531_CONNECTED_CONNECTED:
            util_log("da14531: connected");
            break;
        case DA14531_CONNECTED_CONNECTED_SECURED:
            util_log("da14531: connected secure");
            break;
#endif
        default:
            break;
        }
        break;
    case CTRL_CMD_IRK: {
        // util_log("da14531: get irk");
        //  1 byte cmd
        //  16 bytes irk
        uint8_t response[1 + MEMORY_BLE_IRK_LEN] = {0}; //+1 for cmd
        response[0] = CTRL_CMD_IRK;
        memory_get_ble_irk(&response[1]);
        uint8_t tmp[12 + sizeof(response) * 2];
        uint16_t len = da14531_protocol_format(
            &tmp[0],
            sizeof(tmp),
            DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA,
            &response[0],
            sizeof(response));
        ASSERT(len <= sizeof(tmp));
        for (int i = 0; i < len; i++) {
            rust_bytequeue_put(queue, tmp[i]);
        }
    } break;
    case CTRL_CMD_PRODUCT_STRING: {
        // util_log("da14531: get device mode");
        rust_da14531_set_product(
            rust_util_bytes(da14531_handler_current_product, da14531_handler_current_product_len),
            queue);
    } break;
    case CTRL_CMD_IDENTITY_ADDRESS: {
        // util_log("da14531: get addr");
        //  1 byte cmd
        //  6 bytes addr
        uint8_t response[1 + MEMORY_BLE_ADDR_LEN] = {0};
        response[0] = CTRL_CMD_IDENTITY_ADDRESS;
        memory_get_ble_identity_address(&response[1]);
        uint8_t tmp[12 + sizeof(response) * 2];
        uint16_t len = da14531_protocol_format(
            &tmp[0],
            sizeof(tmp),
            DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA,
            &response[0],
            sizeof(response));
        ASSERT(len <= sizeof(tmp));
        for (int i = 0; i < len; i++) {
            rust_bytequeue_put(queue, tmp[i]);
        }
    } break;
#if !defined(NDEBUG)
    case CTRL_CMD_PAIRING_SUCCESSFUL:
        util_log("da14531: pairing successful");
        break;
    case CTRL_CMD_DEBUG:
        util_log(
            "da14531-debug: %.*s (%d bytes)",
            frame->payload_length - 1,
            &frame->cmd_data[0],
            frame->payload_length - 1);
        break;
#endif
    default:
        break;
    }
}

#if FACTORYSETUP == 0
static void _hww_handler(const struct da14531_protocol_frame* frame, struct RustByteQueue* queue)
{
    // util_log(" in: %s", util_dbg_hex(frame->payload, 64));
    (void)queue;
    if (frame->payload_length != USB_REPORT_SIZE) {
        util_log("da14531: invalid hww payload length %u, dropped frame", frame->payload_length);
        return;
    }
    USB_FRAME usb_frame;
    memcpy(&usb_frame, &frame->payload[0], sizeof(usb_frame));
    usb_packet_process(&usb_frame);
}
#endif

// Handler must not use the frame pointer after it has returned
void da14531_handler(const struct da14531_protocol_frame* frame, struct RustByteQueue* queue)
{
    // util_log("handler called");
    switch (frame->type) {
    case DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA:
        _ctrl_handler((const struct da14531_ctrl_frame*)frame, queue);
        break;
#if FACTORYSETUP == 0
    case DA14531_PROTOCOL_PACKET_TYPE_BLE_DATA:
        _hww_handler(frame, queue);
        break;
#endif
    default:
        break;
    }
}
